import math


def area(r):
    '''
    Возвращает площадь круга по его радиусу.

    Параметры:
        r (float): радиус круга, r >= 0

    Возвращаемое значение:
        area (float): площадь круга, S = πR^2

    Пример вызова:
        area(2)  # вернёт 12.566370614359172
    '''
    return math.pi * r * r


def perimeter(r):
    '''
    Возвращает длину окружности (периметр круга) по его радиусу.

    Параметры:
        r (float): радиус круга, r >= 0

    Возвращаемое значение:
        perimeter (float): длина окружности, P = 2πR

    Пример вызова:
        perimeter(1)  # вернёт 6.283185307179586
    '''
    return 2 * math.pi * r