def area(a, b):
    '''
    Возвращает площадь прямоугольника по длинам его сторон.

    Параметры:
        a (float): длина первой стороны, a >= 0
        b (float): длина второй стороны, b >= 0

    Возвращаемое значение:
        area (float): площадь прямоугольника, S = ab

    Пример вызова:
        area(3, 4)  # вернёт 12
    '''
    return a * b


def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника по длинам его сторон.

    Параметры:
        a (float): длина первой стороны, a >= 0
        b (float): длина второй стороны, b >= 0

    Возвращаемое значение:
        perimeter (float): периметр прямоугольника, P = 2(a + b)

    Пример вызова:
        perimeter(3, 4)  # вернёт 14
    '''
    return (a + b) * 2