def area(a):
    '''
    Возвращает площадь квадрата по длине его стороны.

    Параметры:
        a (float): длина стороны квадрата, a >= 0

    Возвращаемое значение:
        area (float): площадь квадрата, S = a^2

    Пример вызова:
        area(3)  # вернёт 9
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата по длине его стороны.

    Параметры:
        a (float): длина стороны квадрата, a >= 0

    Возвращаемое значение:
        perimeter (float): периметр квадрата, P = 4a

    Пример вызова:
        perimeter(3)  # вернёт 12
    '''
    return 4 * a